app/Models/Attribute.php

    public function getAllAttributeData() {
        return $this->select('d_attribute.id AS id, d_attribute.inc AS inc, d_attribute.attribute_code AS attributeCode, d_attribute.attribute_name AS attributeName, d_attribute.attribute_value AS attributeValue, d_attribute.sequence')
                    ->join('m_inc', 'd_attribute.inc = m_inc.inc', 'left')
---
SELECT `d_attribute`.`id` AS `id`, `d_attribute`.`inc` AS `inc`, `d_attribute`.`attribute_code` AS `attributeCode`, `d_attribute`.`attribute_name` AS `attributeName`, `d_attribute`.`attribute_value` AS `attributeValue`, `d_attribute`.`sequence`
FROM `d_attribute`
LEFT JOIN `m_inc` ON `d_attribute`.`inc` = `m_inc`.`inc`
ORDER BY `d_attribute`.`id`