app/Models/GlobalAttribute.php

SELECT `d_global_attribute`.`attribute_code` AS `globalattributeCode`, `d_global_attribute`.`attribute_name` AS `globalattributeName`, `d_global_attribute`.`created_at` AS `globalCreated`, `d_global_attribute`.`updated_at` AS `globalUpdated`
FROM `d_global_attribute`
ORDER BY `d_global_attribute`.`id`
---
    public function getAllGlobalAttributeData() {
        return $this->select('id, d_global_attribute.attribute_code AS globalattributeCode, d_global_attribute.attribute_name AS globalattributeName, d_global_attribute.created_at AS globalCreated, d_global_attribute.updated_at AS globalUpdated')
                    ->orderBy('d_global_attribute.id')
                    ->findAll();