app/Models/GroupModel.php

    public function getAllGroupData() {
        return $this->select('m_group.group_code AS groupCode, m_group.group_name AS groupName')
---
SELECT `m_group`.`group_code` AS `groupCode`, `m_group`.`group_name` AS `groupName`
FROM `m_group`
ORDER BY `m_group`.`id`