app/Models/Inc.php

    public function getAllIncData() {
        return $this->select('m_inc.INC AS INC, m_inc.INC_NAME AS INCName')
---
SELECT `m_inc`.`INC` AS `INC`, `m_inc`.`INC_NAME` AS `INCName`
FROM `m_inc`
ORDER BY `m_inc`.`id`