app/Models/Material.php

SELECT `d_material`.`id`, `d_material`.`material_number` AS `materialNumber`, `d_material`.`part_number` AS `partNumber`, `d_material`.`raw_data` AS `rawData`, `d_material`.`raw_data2` AS `rawData2`, `d_material`.`raw_data3` AS `rawData3`, `d_material`.`raw_data4` AS `rawData4`, `d_material`.`flag1` AS `flag1`, `d_material`.`flag2` AS `flag2`, `d_material`.`result`, `d_material`.`attribute_value`, `d_material`.`inc`, `d_material`.`mfr`, `d_material`.`group_code` AS `groupCode`, `d_material`.`cat`, `d_material`.`qc`, `d_material`.`status`, `d_material`.`link`, `m_inc`.`inc_name` AS `incName`, `d_attribute`.`attribute_code` AS `attributeCode`, `d_attribute`.`attribute_name` AS `attributeName`, `d_attribute`.`sequence`
FROM `d_material`
LEFT JOIN `m_inc` ON `d_material`.`inc` = `m_inc`.`inc`
LEFT JOIN `d_attribute` ON `d_material`.`inc` = `d_attribute`.`inc`
ORDER BY `d_material`.`id`
---
    public function getAllMaterialData() {
        $materials = $this->select('d_material.material_number AS materialNumber, d_material.part_number AS partNumber, d_material.raw_data AS rawData, d_material.raw_data2 AS rawData2, d_material.raw_data3 AS rawData3, d_material.raw_data4 AS rawData4, d_material.flag1 AS flag1, d_material.flag2 AS flag2, d_material.result, d_material.inc, d_material.mfr, d_material.group_code AS groupCode, d_material.cat, d_material.status, d_material.link, m_inc.inc_name AS incName, d_attribute.attribute_code AS attributeCode, d_attribute.attribute_name AS attributeName, d_attribute.attribute_value AS attributeValue')
                ->join('m_inc', 'd_material.inc = m_inc.inc', 'left')
                ->join('d_attribute', 'd_material.inc = d_attribute.inc', 'left')
                ->orderBy('d_material.id')
                ->asArray()
                ->findAll();