app/Models/User.php

SELECT `user`.`name` AS `userName`, `user`.`role_id` AS `userRoleId`, `m_user_role`.`role_name` AS `userRole`
FROM `user`
LEFT JOIN `m_user_role` ON `user`.`role_id` = `m_user_role`.`role_id`
ORDER BY `user`.`id`
---
    public function getAllUserData() {
        return $this->select('user.id AS userId, user.name AS userName, user.role_id AS userRoleId, m_user_role.role_name AS userRole')
                    ->join('m_user_role', 'user.role_id = m_user_role.role_id', 'left')
                    ->orderBy('user.id')

SELECT `user`.`id` AS `userId`, `user`.`name` AS `userName`, `m_user_role`.`role_name` AS `userRole`
FROM `user`
LEFT JOIN `m_user_role` ON `user`.`role_id` = `m_user_role`.`role_id`
WHERE `user`.`role_id` = 4
ORDER BY `user`.`id`
---
    public function getUserByRole($id) {
        return $this->select('user.id AS userId, user.name AS userName, m_user_role.role_name AS userRole')
                    ->where(['user.role_id' => $id])
                    ->join('m_user_role', 'user.role_id = m_user_role.role_id', 'left')
                    ->orderBy('user.id')